# ส่วนหัวข้อเว็บ (Header)
st.title("ยินดีต้อนรับสู่โปรไฟล์ของฉัน ✨")
st.write("นี่คือเว็บแอปพลิเคชันแรกในชีวิตของดิฉัน เขียนด้วยภาษา Python ค่ะ")

st.divider() # เส้นคั่นแบ่งสัดส่วนให้สวยงาม

# ส่วนข้อมูลส่วนตัว (Profile Info)
st.header("👤 ข้อมูลส่วนตัว")
st.write("**วิลาสินี พงศ์ชนุตม์:** นางสาว เรียนดี มีความรู้")
st.write("**ชั้น ม.4/11** เลขที่ 7")
st.write("**โรงเรียน:** ยุพราชวิทยาลัย")

# ส่วนปุ่มกดแสดงความรู้สึก
if st.button("ความรู้สึกที่ฉันอยากบอก"):
    st.success(f"ว้าวซ่าส์ สนุกมากเลยอ่ะห์ 🎉")
